src/InformationRegisters/ЗадачиКЗагрузке/ЗадачиКЗагрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиКЗагрузке</name>
  <dimensions>
    <name>НомерЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задачи</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ПрефиксВетки</name>
    <type>
      <types>CatalogRef.ПрефиксыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДорабатыватьКонфигурацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаBitrix</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаGit</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Стадия</name>
    <type>
      <types>CatalogRef.СтадииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадачи</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>CatalogRef.Спринты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиБазовой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЗадача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПланировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьКрайнийСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазовойЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияБазовойЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиИтилиум</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаРелиза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаMergeRequest</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеФайлы</name>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КасаемыеПроцессы</name>
    <attributes>
      <name>Процесс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмяПроцесса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>ИДКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спринты</name>
    <attributes>
      <name>Спринт</name>
      <type>
        <types>CatalogRef.Спринты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСпринтРазработки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФактическиеТрудозатраты</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗатраченноеВремя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеЗадачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/РаботаСЗадачами/Module.bsl
// @strict-types


#Область ПрограммныйИнтерфейс
//TODO 1) Вынести в модуль менеджера 2) А это не костыль? 
Процедура ОбновитьЗадачиСПустымиПолями() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи.НомерЗадачи КАК НомерЗадачи,
		|	Задачи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Задачи КАК Задачи
		|ГДЕ
		|	Задачи.ОсновнаяЗадача = ЗНАЧЕНИЕ(Справочник.Задачи.ПустаяСсылка)
		|	И Задачи.НомерЗадачиБазовой <> ""0""
		|	И Задачи.НомерЗадачиБазовой <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Задачи.НомерЗадачи,
		|	Задачи.Ссылка
		|ИЗ
		|	Справочник.Задачи КАК Задачи
		|ГДЕ
		|	Задачи.Постановщик = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Задачи.НомерЗадачи,
		|	Задачи.Ссылка
		|ИЗ
		|	Справочник.Задачи КАК Задачи
		|ГДЕ
		|	Задачи.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НомераЗадачи = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НомерЗадачи");
	Для Каждого Номер Из НомераЗадачи Цикл
		РегистрыСведений.ЗадачиКЗагрузке.ДобавитьЗадачу(Номер);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьДанныеЗадач() Экспорт
	
	ТаблицаЗадач = Справочники.Задачи.НеЗакрытыеЗадачи();
	ТипыТаскТрекеров = ТаблицаЗадач.Скопировать();
	ТипыТаскТрекеров.Свернуть("ТипТаскТрекера");
	
	Для Каждого ТипТаскТрекера Из ТипыТаскТрекеров Цикл
	
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ТипТаскТрекера", ТипТаскТрекера);
		
		ТаблицаЗадачПоТаскТрекеру = ТаблицаЗадач.Скопировать(ПараметрыОтбора);
		
		МенеджерТаскТрекера = Перечисления.ТаскТрекеры.МенеджерТаскТрекера(ТипТаскТрекера);
		МенеджерТаскТрекера.ОбновитьДанныеЗадачПоТаблице(ТаблицаЗадачПоТаскТрекеру);
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
